# desc = {
#     '下一代信息网络产业': '计算机和辅助设备修理高端路由器、单槽位处理路由器等其他计算机制造；新一代移动通信基站设备、数字程控交换机等通信系统设备制造。光纤宽带运营服务；新一代移动通信核心网和接入网建设、组网等移动电信服务；移动话音服务、移动数据通信服务等其他电信服务。计算机整机制造；手持平板电脑显示设备等计算机零部件制造；人机交互设备、图形图像输出设备等计算机外围设备制造；工业控制计算机及系统制造；云平台、物联网等其他计算机制造；移动智能终端；雷达及配套设备制造；智能医疗系统、RFID等其他电子设备制造。互联网接入及相关服务；下一代互联网运营服务、光纤出租服务等其他电信服务；基于IPv6技术提供的网络平台服务、互联网资源协作服务。',
#     '互联网与云计算、大数据服务': '互联网智能制造服务平台、互联网协同制造平台等互联网生产服务平台；工业生产大数据资源服务、工业数据库和工业云数据库服务等互联网数据服务；工业物联网服务；工业互联网技术系统服务、工业人工智能网络系统服务；工业物联网信息感知、传感技术服务等物联网技术服务；工业网络运行、工业局域网维护服务、工业互联网基础环境运行服务；工业信息和数据处理、工业数据集成服务等信息处理和存储支持服务。大数据资源服务、数据库和云数据库服务等互联网数据服务；云计算软件、新一代海量信息智能搜索软件、数据挖掘软件、云端融合应用运行支撑平台软件。互联网搜索服务；网上新闻服务、网站导航服务等互联网其他信息服务。互联网平台。',
#     '人工智能': '生产领域人工智能系统、智能家居系统等信息系统集成服务。可穿戴智能设备制造；智能无人飞行器制造；数字家庭智能终端设备、智能感知与控制设备等其他智能消费设备制造；金融电子应用产品；生产领域人工智能系统、智能家居系统等信息系统集成服务；人工智能优化操作系统、人工智能中间件、函数库；计算机视听觉软件、生物特征识别软件等应用软件开发。人工智能优化操作系统、人工智能中间件、函数库；计算机视听觉软件、生物特征识别软件等应用软件开发。生产领域人工智能系统、智能家居系统等信息系统集成服务；人工智能优化操作系统、人工智能中间件、函数库；计算机视听觉软件、生物特征识别软件等应用软件开发。人脑、杏仁核、癫痫等脑部结构和脑部疾病',
#     '新兴软件和新型信息技术服务': '互联网安全服务。集成电路设计；农业、智能交通物联网应用服务等其他互联网服务；集成实施服务、信息系统设计服务等信息系统集成服务；仓库、货物识别系统；企业对个人（B2C）电子商务服务、数据存储、备份服务等信息处理和存储支持服务；信息化规划、信息技术管理咨询等信息技术咨询服务；客户交互服务。基础类网络与信息安全软件、网络与边界安全类软件等其他软件开发。平行链、中继链、以太币等区块链相关关键词量子通信、量子秘钥分发。',
#     '电子核心产业': '聚烯烃类材料、软材料及硅基复合材料；六氟磷酸锂碳酸酯类溶液；铝塑膜、透明导电薄膜材料、电子元件专用厚薄膜材料；6代及以上玻璃基板；玻璃陶瓷、石英系光纤光缆材料；高性能陶瓷基板、气敏陶瓷材料等特种陶瓷制品制造；石墨类材料、硬碳材料；锂离子电池单体、模块及系统；模块化镍氢电池储能系统；超级电容单体、模块及系统等其他电池制造；高性能混合液晶、驱动IC等电子专用材料制造。数字电视测试仪器、通信与网络测试仪器等电子测量仪器制造。光纤制造；显示器件制造；光电子器件制造；敏感元件及传感器制造；集成电路生产线设备、IGBT生产线设备等半导体器件专用设备制造；片式元器件生产设备、频率器件生产设备等电子元器件与机电组件设备制造；磁控溅射设备、准分子激光退火设备等其他电子专用设备制造；铝合金电缆、复合海底电缆、高压超高压电缆；特种用途真空器件；新型晶体器件、中大功率高压绝缘栅双极晶体管等半导体分立器件制造；半导体发光二极管、LED背光源；驱动电路、电子纸等其他电子器件制造；新型频率元件、高精密电阻器件；新型连接元件、高密度互连印制电路板等电子电路制造；新型电声元件制造；新型片式元件、超导滤波器等其他电子元件制造。互联网安全服务。集成电路制造；生产专用光刻机、刻蚀机等半导体器件专用设备制造。量子计算、量子芯片、量子测控等量子计算机相关关键词。'
# }

PATENT_CLS_NAMES = [
    '新兴软件和新型信息技术服务',
    '电子核心产业',
    '下一代信息网络产业',
    '人工智能',
    '互联网与云计算、大数据服务'
]

PATENT_CLS_ORDER = {
    '新兴软件和新型信息技术服务': 0,
    '电子核心产业': 1,
    '下一代信息网络产业': 2,
    '人工智能': 3,
    '互联网与云计算、大数据服务': 4
}

